CREATE TABLE IF NOT EXISTS `partymember`(
   `id` INT UNSIGNED AUTO_INCREMENT,
   `partyname` VARCHAR(10) NOT NULL,
   `student_id` INT NOT NULL,
   `telephone` BIGINT NOT NULL,
   `card_id` VARCHAR(18),
   `superior` VARCHAR(40),
   `base` VARCHAR(40),
   `college` VARCHAR(12),
   `time_i` DATE,
   `time_o` DATE,
   `field` TINYINT(40) default 0,
   `formal` TINYINT(40) default 1,
   `renew` TINYINT(40) default 0,
   `stream` TINYINT(40) default 0,
   `data` timestamp not null default current_timestamp,
   PRIMARY KEY ( `id` )
)ENGINE=InnoDB DEFAULT CHARSET=utf8;
INSERT `partymember` (partyname, student_id, telephone, card_id, superior, base, college, field, time_i, time_o, formal, renew, stream) VALUES 
( '李晓彤', 15722648, 15201892805,  '340406199406122825',  '中国移动通信集团有限公司',  '咪咕公司',  '新闻与传播学院', 0, '2018-6-30', '2018-6-29', 1, 0, 2),
( '李萌', 15722871, 18800202127,  '412728199310055220',  '中共嘉定区金鹤小学支部委员会',  NULL,  '社科学部', 1, '2018-6-30', '2018-6-29', 1, 0, 2),
( '郭浩', 15723001, 13262606853,  '360782199306301320',  '荔城经济开发区党委',  '三棵树党委',  '纳米中心', 0, '2018-6-30', '2018-6-29', 1, 0, 2),
( '王雪雯', 15723057, 18616319337,  '411282199203130045',  '安亭镇党委',  NULL,  '数码学院', 1, '2018-7-30', '2018-6-29', 0, 0, 2),
( '邵旭青', 15723109, 18817606016,  '130105199310130626',  '中共石家庄市桥西区委组织部',  '中共石家庄市桥西区南长街道经八条社区总支委员会',  '新闻传播学院', 0, '2018-7-30', '2018-6-29', 1, 0, 2),
( '玉钰', 15723359, 18817308007,  '371102199209130329',  '中共日照市委组织部',  '山东省日照经济技术开发区北宇路街道党委',  '音乐学院', 0, '2018-6-30', '2018-6-29', 1, 0, 2),
( '位云蛟', 15723360, 15216893367,  '371521199107032227',  '中共濮阳市华龙区委组织部',  '中共濮阳市华龙区人力资源和社会保障局流动党员支部委员会',  '音乐学院', 0, '2018-6-30', '2018-6-29', 0, 0, 2),
( '谷峰', 15723658, 18800201871,  '320125199209291717',  '中共国泰君安证券股份有限公司委员会',  NULL,  '理学院', 1,'2018-7-30', '2018-6-29', 1, 0, 2),
( '刘吉鹏', 15723743, 18817394151,  '210213199203092519',  '中共华域视觉科技（上海）有限公司委员会',  NULL,  '机自学院', 1, '2018-6-30', '2018-6-29', 1, 1, 3),
( '李琪', 15723855, 17621910519,  '130802199205191020',  '中共承德市委组织部',  '承德市双桥区石洞子沟街道石洞子沟社区党支部',  '生命科学学院', 0, '2018-6-30', '2018-6-29', 1, 0, 2)
